000100210114
000200210114/****************/
000300210114/* Coded by Gui */
000400210114/* **************/
000500210114pgm
000600210114WRKOBJPDM dw433f24
000700210114dspmsg
000800210114wrksplf
000900210114endpgm
001000210114/*test*/
