000001210131
000002210131
000100210131       DCL-F COVIDDSP WORKSTN;
000101210131
000103210131       EXSR CLEAR;
000105210131       EXFMT RISKFACTOR;
000106210131
000107210131       // WHILE NOT F3(IN03)
000108210131       DOW NOT(*IN03); //DOW(*IN03 = *OFF) // DOU *IN03
000109210131         IF GENDER = ' ';
000110210131           *IN95 = *ON; //TIP TEXT ON
000111210131           EXFMT RISKFACTOR;
000112210131           *in95 = *OFF; //TIP TEXT OFF
000113210131           ITER;
000114210131
000115210131         ELSEIF CVDISEASE = ' ';
000116210131           *IN96 = *ON;
000117210131           EXFMT RISKFACTOR;
000118210131           *in96 = *OFF;
000119210131           ITER;
000120210131
000121210131         ELSEIF DIABETES = ' ';
000122210131           *IN97 = *ON;
000123210131           EXFMT RISKFACTOR;
000124210131           *in97 = *OFF;
000125210131           ITER;
000126210131
000127210131         ELSEIF RSPDISEASE = ' ';
000128210131           *IN98 = *ON;
000129210131           EXFMT RISKFACTOR;
000130210131           *in98 = *OFF;
000131210131           ITER;
000132210131
000133210131         ELSEIF HBPRESSURE = ' ';
000134210131           *IN99 = *ON;
000135210131           EXFMT RISKFACTOR;
000136210131           *in99 = *OFF;
000137210131           ITER;
000138210131
000139210131         ELSE;
000140210131           //EXECUTE 2ND SCREEN
000141210131           EXSR DETERMINERISK;
000142210131           TOTALQ = TOTALQ +1; // INCREASES NUMBER OF QUERIES
000143210131           *IN60 = *ON;        // PROTECT FIELDS
000144210131           WRITE RISKFACTOR;   // WRITE FIRST SCREEN
000146210131           EXFMT RISKASSMNT;   // EXECUTE 2ND SCREEN
000147210203           *IN60 = *OFF;       // unlock fields
000151210131
000152210131         ENDIF;
000153210131
000154210131         IF *IN03 = *OFF; //USER CHOSE NOT TO EXIT (PRESSED ENTER)
000155210131           EXSR CLEAR;
000156210131           EXFMT RISKFACTOR;
000157210131         ENDIF;
000158210131
000159210131       ENDDO;
000160210131
000161210131       *INLR = *ON;
000162210131       RETURN;
000163210131
000164210131       BEGSR CLEAR;
000165210131         *IN95 = *OFF;
000166210131         CLEAR BIRTHDATE;
000167210203         GENDER =' ';   // CLEAR GENDER (ANOTHER WAY TO CLEAR)
000168210203         CVDISEASE =''; // this also clear field
000169210131         CLEAR DIABETES;
000170210131         CLEAR RSPDISEASE ;
000171210131         CLEAR HBPRESSURE;
000172210131       ENDSR;
000173210131
000174210131       BEGSR DETERMINERISK;
000175210131         //DUMMIE IN LAB03
000176210131         AGE = 25;
000177210131         FRATE = 0.052;
000178210131         COHORT = 'GROUP 4';
000179210131       ENDSR;
