000001210203     A          R CINFO
000002210203     A                                  2 31'Cohort Recomendation'
000003210203     A                                  5 20'Risk Factor Cohort'
000004210203     A                                  7 20'9.5 - 99.9 Group 1'
000005210203     A                                  8 20'5.5 -  9.4 Group 2'
000006210203     A                                  9 20'3.5 -  5.4 Group 3'
000007210203     A                                 10 20'1.5 -  3.4 Group 4'
000008210203     A                                 11 20'0.5 -  1.4 Group 5'
000009210203     A                                 14  6'Health care and front line workers-
000010210203     A                                       will be in either Group 1 or Group-
000011210203     A                                       '
000012210203     A                                      DSPATR(RI)
000100      
