000001210205
000100210131       DCL-F COVIDDSP WORKSTN;
000101210203       DCL-F COVIDINFO WORKSTN;
000102210204       dcl-s tage int(5);
000103210131
000104210131       EXSR CLEAR;
000105210131       EXFMT RISKFACTOR;
000106210131
000107210131       // WHILE NOT F3(IN03)
000108210131       DOW NOT(*IN03); //DOW(*IN03 = *OFF) // DOU *IN03
000109210204
000112210204         IF GENDER = ' ';
000113210131           *IN95 = *ON; //TIP TEXT ON
000114210131           EXFMT RISKFACTOR;
000115210131           *in95 = *OFF; //TIP TEXT OFF
000116210131           ITER;
000117210131
000118210131         ELSEIF CVDISEASE = ' ';
000119210131           *IN96 = *ON;
000120210131           EXFMT RISKFACTOR;
000121210131           *in96 = *OFF;
000122210131           ITER;
000123210131
000124210131         ELSEIF DIABETES = ' ';
000125210131           *IN97 = *ON;
000126210131           EXFMT RISKFACTOR;
000127210131           *in97 = *OFF;
000128210131           ITER;
000129210131
000130210131         ELSEIF RSPDISEASE = ' ';
000131210131           *IN98 = *ON;
000132210131           EXFMT RISKFACTOR;
000133210131           *in98 = *OFF;
000134210131           ITER;
000135210131
000136210131         ELSEIF HBPRESSURE = ' ';
000137210131           *IN99 = *ON;
000138210131           EXFMT RISKFACTOR;
000139210131           *in99 = *OFF;
000140210131           ITER;
000141210131
000142210131         ELSE;
000143210131           //EXECUTE 2ND SCREEN
000144210131           EXSR DETERMINERISK;
000145210131           TOTALQ = TOTALQ +1; // INCREASES NUMBER OF QUERIES
000146210131           *IN60 = *ON;        // PROTECT FIELDS
000147210131           WRITE RISKFACTOR;   // WRITE FIRST SCREEN
000148210131           EXFMT RISKASSMNT;   // EXECUTE 2ND SCREEN
000149210203
000150210203           //OPEN COVID INFO
000151210203           IF *IN01 = *on;
000152210203             EXFMT CINFO;
000153210205             //going back
000154210205             WRITE RISKFACTOR;
000155210205             EXFMT RISKASSMNT;
000156210205           ENDIF;
000158210203
000159210205           *IN60 = *OFF;       // unlock fields
000161210203         ENDIF;
000162210131
000163210203         IF *IN03 = *OFF; //USER CHOSE NOT TO EXIT (PRESSED ENTER)
000164210203           EXSR CLEAR;
000165210203           EXFMT RISKFACTOR;
000166210203         ENDIF;
000167210131
000168210131       ENDDO;
000169210131
000170210131       *INLR = *ON;
000171210131       RETURN;
000172210131
000173210131       BEGSR CLEAR;
000174210203         *IN95 = *OFF;
000175210203         CLEAR BIRTHDATE;
000176210203         GENDER =' ';   // CLEAR GENDER (ANOTHER WAY TO CLEAR)
000177210203         CVDISEASE =''; // this also clear field
000178210203         CLEAR DIABETES;
000179210203         CLEAR RSPDISEASE ;
000180210203         CLEAR HBPRESSURE;
000181210131       ENDSR;
000182210131
000183210131       BEGSR DETERMINERISK;
000184210204         //CALCULATING AGE
000185210204         tAGE = %DIFF(%DATE():BIRTHDATE:*Y);
000186210204         IF tAGE > 999;
000187210204           AGE = 999;
000188210205         else;
000189210205           age = tage;
000190210204         ENDIF;
000191210203         //CALCULATING FRATE
000192210203         //FRATE = 0.052;
000193210203         SELECT;
000194210203         WHEN AGE >= 80;
000195210203           FRATE =   14.800;
000196210203         WHEN AGE >= 70;
000197210203           FRATE =   8.000;
000198210203         WHEN AGE >= 60;
000199210203           FRATE =   3.600;
000200210203         WHEN AGE >= 50;
000201210203           FRATE =   1.300;
000202210203         WHEN AGE >= 40;
000203210203           FRATE =   0.400;
000204210203         WHEN AGE >= 30;
000205210203           FRATE =   .250;
000206210203         WHEN AGE >= 20;
000207210203           FRATE =   .230;
000208210203         WHEN AGE >= 10;
000209210203           FRATE =   .200;
000210210203         OTHER;
000211210203           FRATE =   .100;
000212210203         ENDSL;
000213210203
000214210203         IF GENDER = 'F';
000215210203           FRATE -= 0.05;
000216210203         ENDIF;
000217210203
000218210203         IF CVDISEASE = 'Y';
000219210203           FRATE += .8;
000220210203         ENDIF;
000221210203         IF DIABETES = 'Y';
000222210203           FRATE += .6;
000223210203         ENDIF;
000224210203         IF RSPDISEASE = 'Y';
000225210203           FRATE += .4;
000226210203         ENDIF;
000227210203         IF  HBPRESSURE = 'Y';
000228210203           FRATE += .3;
000229210203         ENDIF;
000230210203
000231210203         //SETTING GROUP
000232210203         SELECT;
000233210203         WHEN FRATE >9.4;
000234210203           COHORT = 'GROUP 1';
000235210203         WHEN FRATE >5.4;
000236210203           COHORT = 'GROUP 2';
000237210203         WHEN FRATE >3.4;
000238210203           COHORT = 'GROUP 3';
000239210203         WHEN FRATE >1.4;
000240210203           COHORT = 'GROUP 4';
000241210203         OTHER;
000242210203           COHORT = 'GROUP 5';
000243210203         ENDSL;
000244210203
000245210203       ENDSR;
